export default [
  {
    key: '{1}',
    value: '来源单位 (例：新乡市牧野区新辉社区卫生服务中心)'
  },
  {
    key: '{2}',
    value: '姓名 (例：张三)'
  },
  {
    key: '{3}',
    value: '科目 (例：Ⅰ期临床实验室)'
  },
  {
    key: '{4}',
    value: '时长 (例：12)'
  },
  {
    key: '{5}',
    value: '报到时间 (例：2018年09月26日)'
  },
  {
    key: '{6}',
    value: '结业时间 (例：2019年09月25日)'
  },
  {
    key: '{7}',
    value: '进修费 (例：3600)'
  },
  {
    key: '{8}',
    value: '杂支 (例：300)'
  },
  {
    key: '{9}',
    value: '合计 (例：3900)'
  },
]



