let floorInfo = {
  f1: [
    {
      x: 1960, // 横坐标
      y: 270, // 纵坐标
      width: 228, // 宽度
      height: 201, // 高度
      text: '101', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2505, // 横坐标
      y: 165, // 纵坐标
      width: 276, // 宽度
      height: 270, // 高度
      text: '102', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2774, // 横坐标
      y: 142, // 纵坐标
      width: 120, // 宽度
      height: 110, // 高度
      text: '103', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2990, // 横坐标
      y: 300, // 纵坐标
      width: 280, // 宽度
      height: 760, // 高度
      text: '104', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2400, // 横坐标
      y: 600, // 纵坐标
      width: 120, // 宽度
      height: 115, // 高度
      text: '105', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2012, // 横坐标
      y: 580, // 纵坐标
      width: 116, // 宽度
      height: 120, // 高度
      text: '106', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1980, // 横坐标
      y: 760, // 纵坐标
      width: 127, // 宽度
      height: 205, // 高度
      text: '107', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1130, // 横坐标
      y: 870, // 纵坐标
      width: 140, // 宽度
      height: 90, // 高度
      text: '108', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1130, // 横坐标
      y: 760, // 纵坐标
      width: 140, // 宽度
      height: 90, // 高度
      text: '109', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1082, // 横坐标
      y: 580, // 纵坐标
      width: 195, // 宽度
      height: 110, // 高度
      text: '110', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 880, // 横坐标
      y: 580, // 纵坐标
      width: 106, // 宽度
      height: 155, // 高度
      text: '111', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 266, // 横坐标
      y: 310, // 纵坐标
      width: 747, // 宽度
      height: 280, // 高度
      text: '112', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 740, // 横坐标
      y: 165, // 纵坐标
      width: 270, // 宽度
      height: 270, // 高度
      text: '113', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 440, // 横坐标
      y: 120, // 纵坐标
      width: 110, // 宽度
      height: 165, // 高度
      text: '114', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
  ],
  f2: [
    {
      x: 1930, // 横坐标
      y: 250, // 纵坐标
      width: 232, // 宽度
      height: 220, // 高度
      text: '201', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2452, // 横坐标
      y: 150, // 纵坐标
      width: 165, // 宽度
      height: 286, // 高度
      text: '202', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2800, // 横坐标
      y: 180, // 纵坐标
      width: 265, // 宽度
      height: 116, // 高度
      text: '203', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2717, // 横坐标
      y: 272, // 纵坐标
      width: 260, // 宽度
      height: 300, // 高度
      text: '204', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 3023, // 横坐标
      y: 464, // 纵坐标
      width: 150, // 宽度
      height: 545, // 高度
      text: '205', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2395, // 横坐标
      y: 586, // 纵坐标
      width: 292, // 宽度
      height: 154, // 高度
      text: '206', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 1928, // 横坐标
      y: 583, // 纵坐标
      width: 230, // 宽度
      height: 130, // 高度
      text: '207', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1938, // 横坐标
      y: 816, // 纵坐标
      width: 150, // 宽度
      height: 160, // 高度
      text: '208', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1712, // 横坐标
      y: 871, // 纵坐标
      width: 200, // 宽度
      height: 105, // 高度
      text: '209', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1712, // 横坐标
      y: 585, // 纵坐标
      width: 140, // 宽度
      height: 255, // 高度
      text: '210', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1488, // 横坐标
      y: 581, // 纵坐标
      width: 140, // 宽度
      height: 390, // 高度
      text: '211', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1106, // 横坐标
      y: 585, // 纵坐标
      width: 198, // 宽度
      height: 390, // 高度
      text: '213', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 852, // 横坐标
      y: 570, // 纵坐标
      width: 110, // 宽度
      height: 170, // 高度
      text: '214', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 320, // 横坐标
      y: 740, // 纵坐标
      width: 450, // 宽度
      height: 168, // 高度
      text: '215', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 242, // 横坐标
      y: 267, // 纵坐标
      width: 377, // 宽度
      height: 334, // 高度
      text: '216', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 400, // 横坐标
      y: 140, // 纵坐标
      width: 140, // 宽度
      height: 140, // 高度
      text: '217', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 704, // 横坐标
      y: 160, // 纵坐标
      width: 130, // 宽度
      height: 195, // 高度
      text: '218', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 846, // 横坐标
      y: 265, // 纵坐标
      width: 130, // 宽度
      height: 195, // 高度
      text: '219', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
  ],
  f3: [
    {
      x: 1950, // 横坐标
      y: 277, // 纵坐标
      width: 98, // 宽度
      height: 153, // 高度
      text: '301', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2068, // 横坐标
      y: 255, // 纵坐标
      width: 98, // 宽度
      height: 200, // 高度
      text: '302', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2202, // 横坐标
      y: 380, // 纵坐标
      width: 124, // 宽度
      height: 70, // 高度
      text: '303', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2366, // 横坐标
      y: 371, // 纵坐标
      width: 274, // 宽度
      height: 80, // 高度
      text: '304', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2750, // 横坐标
      y: 300, // 纵坐标
      width: 274, // 宽度
      height: 427, // 高度
      text: '305', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2362, // 横坐标
      y: 590, // 纵坐标
      width: 340, // 宽度
      height: 227, // 高度
      text: '306', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1974, // 横坐标
      y: 590, // 纵坐标
      width: 176, // 宽度
      height: 125, // 高度
      text: '307', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1744, // 横坐标
      y: 600, // 纵坐标
      width: 176, // 宽度
      height: 125, // 高度
      text: '308', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1516, // 横坐标
      y: 590, // 纵坐标
      width: 176, // 宽度
      height: 125, // 高度
      text: '309', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1400, // 横坐标
      y: 585, // 纵坐标
      width: 86, // 宽度
      height: 125, // 高度
      text: '310', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1284, // 横坐标
      y: 597, // 纵坐标
      width: 86, // 宽度
      height: 125, // 高度
      text: '311', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1074, // 横坐标
      y: 595, // 纵坐标
      width: 172, // 宽度
      height: 120, // 高度
      text: '312', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 842, // 横坐标
      y: 580, // 纵坐标
      width: 142, // 宽度
      height: 80, // 高度
      text: '313', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 746, // 横坐标
      y: 652, // 纵坐标
      width: 142, // 宽度
      height: 80, // 高度
      text: '314', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 660, // 横坐标
      y: 724, // 纵坐标
      width: 142, // 宽度
      height: 80, // 高度
      text: '315', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 516, // 横坐标
      y: 808, // 纵坐标
      width: 142, // 宽度
      height: 80, // 高度
      text: '316', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 408, // 横坐标
      y: 694, // 纵坐标
      width: 131, // 宽度
      height: 148, // 高度
      text: '317', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 296, // 横坐标
      y: 577, // 纵坐标
      width: 131, // 宽度
      height: 148, // 高度
      text: '318', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 176, // 横坐标
      y: 403, // 纵坐标
      width: 180, // 宽度
      height: 126, // 高度
      text: '319', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 234, // 横坐标
      y: 297, // 纵坐标
      width: 170, // 宽度
      height: 80, // 高度
      text: '320', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 312, // 横坐标
      y: 215, // 纵坐标
      width: 170, // 宽度
      height: 80, // 高度
      text: '321', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 402, // 横坐标
      y: 155, // 纵坐标
      width: 130, // 宽度
      height: 80, // 高度
      text: '322', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 722, // 横坐标
      y: 143, // 纵坐标
      width: 84, // 宽度
      height: 163, // 高度
      text: '323', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 806, // 横坐标
      y: 217, // 纵坐标
      width: 84, // 宽度
      height: 163, // 高度
      text: '324', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 806, // 横坐标
      y: 217, // 纵坐标
      width: 84, // 宽度
      height: 163, // 高度
      text: '324', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 884, // 横坐标
      y: 305, // 纵坐标
      width: 84, // 宽度
      height: 126, // 高度
      text: '325', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 570, // 横坐标
      y: 370, // 纵坐标
      width: 77, // 宽度
      height: 100, // 高度
      text: '326', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 476, // 横坐标
      y: 460, // 纵坐标
      width: 77, // 宽度
      height: 100, // 高度
      text: '327', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 642, // 横坐标
      y: 465, // 纵坐标
      width: 96, // 宽度
      height: 216, // 高度
      text: '328', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
  ],
  f4: [
    {
      x: 1960, // 横坐标
      y: 258, // 纵坐标
      width: 188, // 宽度
      height: 198, // 高度
      text: '401', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2202, // 横坐标
      y: 380, // 纵坐标
      width: 96, // 宽度
      height: 64, // 高度
      text: '402', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2340, // 横坐标
      y: 380, // 纵坐标
      width: 150, // 宽度
      height: 64, // 高度
      text: '404', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2496, // 横坐标
      y: 144, // 纵坐标
      width: 120, // 宽度
      height: 84, // 高度
      text: '405', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 2756, // 横坐标
      y: 294, // 纵坐标
      width: 263, // 宽度
      height: 215, // 高度
      text: '406', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2362, // 横坐标
      y: 584, // 纵坐标
      width: 589, // 宽度
      height: 239, // 高度
      text: '407', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 2016, // 横坐标
      y: 582, // 纵坐标
      width: 130, // 宽度
      height: 135, // 高度
      text: '408', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1890, // 横坐标
      y: 582, // 纵坐标
      width: 86, // 宽度
      height: 135, // 高度
      text: '409', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1738, // 横坐标
      y: 582, // 纵坐标
      width: 130, // 宽度
      height: 130, // 高度
      text: '410', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1510, // 横坐标
      y: 582, // 纵坐标
      width: 192, // 宽度
      height: 130, // 高度
      text: '411', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1286, // 横坐标
      y: 582, // 纵坐标
      width: 192, // 宽度
      height: 130, // 高度
      text: '412', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 1062, // 横坐标
      y: 582, // 纵坐标
      width: 192, // 宽度
      height: 130, // 高度
      text: '413', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 778, // 横坐标
      y: 588, // 纵坐标
      width: 148, // 宽度
      height: 135, // 高度
      text: '414', // 房间号
      angle: 0 // 旋转角度（没有为0）
    },
    {
      x: 478, // 横坐标
      y: 620, // 纵坐标
      width: 315, // 宽度
      height: 185, // 高度
      text: '415', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 656, // 横坐标
      y: 448, // 纵坐标
      width: 96, // 宽度
      height: 215, // 高度
      text: '416', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 556, // 横坐标
      y: 356, // 纵坐标
      width: 105, // 宽度
      height: 267, // 高度
      text: '417', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 314, // 横坐标
      y: 226, // 纵坐标
      width: 160, // 宽度
      height: 186, // 高度
      text: '418', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 398, // 横坐标
      y: 148, // 纵坐标
      width: 138, // 宽度
      height: 80, // 高度
      text: '419', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 722, // 横坐标
      y: 156, // 纵坐标
      width: 175, // 宽度
      height: 145, // 高度
      text: '420', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
    {
      x: 880, // 横坐标
      y: 296, // 纵坐标
      width: 92, // 宽度
      height: 167, // 高度
      text: '421', // 房间号
      angle: Math.PI / 4 // 旋转角度（没有为0）
    },
  ]
};

export default floorInfo;
